## Handling missing data
In pandas, numeric missing data is represented as NaN (Not a Number)

In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avacado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
# None can also be treated as a NA in arrays
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out Missing Data

In [4]:
# dropna - it is used to drop alll the null values and display the object
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data[data.notnull()] # serves the same function as dropna

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
# for dataframe objects, dropna will drop any row containing a missing value
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all') # how = 'all' will only drop rows whose every element is NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.727508       NaN       NaN
1  0.063395       NaN       NaN
2  2.526922       NaN -2.332185
3 -0.935387       NaN  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [12]:
df.dropna()

          0         1         2
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [13]:
# thresh can be used to drop rows only containing a certain number of observations of missing values
df.dropna(thresh = 2)

          0         1         2
2  2.526922       NaN -2.332185
3 -0.935387       NaN  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

### Filling in Missing Values

In [14]:
# fillna - it is used to fill/replace the missing values with a specified value
df

          0         1         2
0 -1.727508       NaN       NaN
1  0.063395       NaN       NaN
2  2.526922       NaN -2.332185
3 -0.935387       NaN  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [15]:
df.fillna(0)

          0         1         2
0 -1.727508  0.000000  0.000000
1  0.063395  0.000000  0.000000
2  2.526922  0.000000 -2.332185
3 -0.935387  0.000000  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [16]:
# fillna with dict can will a different value for each column(column_index:value)
df.fillna({1:0.5, 2:0})

          0         1         2
0 -1.727508  0.500000  0.000000
1  0.063395  0.500000  0.000000
2  2.526922  0.500000 -2.332185
3 -0.935387  0.500000  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [18]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -1.727508  0.000000  0.000000
1  0.063395  0.000000  0.000000
2  2.526922  0.000000 -2.332185
3 -0.935387  0.000000  0.206300
4  0.712653  2.698065 -0.042603
5 -0.037107 -0.726611 -0.448607
6 -1.312564  0.079274 -0.756321

In [19]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.736979  1.858286 -0.125659
1  0.232914 -0.466189  0.222211
2  0.160017       NaN  1.133691
3  0.161755       NaN  0.025461
4  0.205989       NaN       NaN
5  0.793060       NaN       NaN

In [20]:
df.fillna(method='ffill') # the ffill method replaces the missing values with the value from the previous row/column/element

          0         1         2
0 -0.736979  1.858286 -0.125659
1  0.232914 -0.466189  0.222211
2  0.160017 -0.466189  1.133691
3  0.161755 -0.466189  0.025461
4  0.205989 -0.466189  0.025461
5  0.793060 -0.466189  0.025461

In [21]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.736979  1.858286 -0.125659
1  0.232914 -0.466189  0.222211
2  0.160017 -0.466189  1.133691
3  0.161755 -0.466189  0.025461
4  0.205989       NaN  0.025461
5  0.793060       NaN  0.025461

In [22]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

In [1]:
import pandas as pd
import numpy as np
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated() # returns a boolean series indicating duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates() # drops the duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [8]:
data.drop_duplicates(['k1']) # we can also specify the columns for dropping the duplicates|

    k1  k2  v1
0  one   1   0
1  two   1   1

In [10]:
data.drop_duplicates(['k1'], keep='last') # the previous one selects the first observed value, keep='last', will select the last one

    k1  k2  v1
4  one   3   4
6  two   4   6

### Transforming data using Functions or Mapping

In [4]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [1]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [2]:
import pandas as pd
import numpy as np

In [6]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [7]:
# the map method can be used to map a dictionary type object to a Series/DataFrame column
data['animal'] = lowercased.map(meat_to_animal)
data
# map function basically does element wise mapping

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [8]:
# we can also use a user defind function to do all the work
data['food'].map(lambda x: meat_to_animal[x.lower()])
# map function is used for element wise transformations and for data cleaning tasks

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing values

In [9]:
# we can use the repalce function to replace the specified value
# fillna is used for more generalized replacement
# replace can be used to replace very specific elements
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [10]:
data.replace(-999, np.nan) 
# we are replcaing -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [11]:
data.replace([-999, -1000], np.nan) 
# to replace multiple values we pass a list of the values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [12]:
data.replace({-999: np.nan, -1000: "maximum redundancy"})
# we can pass a dict to do element wise replacement

0                   1.0
1                   NaN
2                   2.0
3                   NaN
4    maximum redundancy
5                   3.0
dtype: object

In [17]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 ....: index=['Ohio', 'Colorado', 'New York'],
 ....: columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [18]:
transform = lambda x: x[:4].upper()
data.index.map(transform)
# the index attribute of a dataframe also has map method

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [20]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [21]:
# if we want to create a tranfromed version of a dataset without modifying the original then we use renaeme
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [22]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})
# we can also pass dict like values

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [23]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning
Continuous data is often discretized or otherwise separated into 'bins' for anlysis

In [24]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [25]:
bins = [18, 25, 35, 60, 100] # to divide into bins we use the cut function
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [26]:
# the return type is a special Categorical object 
# from the above output we can see that there are 4 bins created
# () - not included ; [] - included
# by dfault left is open and right is closed, we can change this by passing right=False
# the 'codes' attribute contains the labeling for each of the ages data
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [27]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [29]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [30]:
# we can also pass our own labels for the bins
group_names = ['Youth', 'Young Adult', 'Middle Aged', 'Senior']
pd.cut(ages, [18, 26, 36, 61, 100], right=False, labels=group_names)

['Youth', 'Youth', 'Youth', 'Young Adult', 'Youth', ..., 'Young Adult', 'Senior', 'Middle Aged', 'Middle Aged', 'Young Adult']
Length: 12
Categories (4, object): ['Youth' < 'Young Adult' < 'Middle Aged' < 'Senior']

In [40]:
# if we pass an integer 'n' insted of a bin array, it will create equally-sized n bins
# it does so by staring from the minimum value to the maximum value
data = np.random.randn(20)
print(data)
cats = pd.cut(data, 5, precision=2) # the precision limits the the decimal to 2 digits
cats

[-0.65069243  1.15345927 -0.44586161  0.49724218 -0.38500768  2.05418704
  0.4949542  -1.21411248  0.94939992  0.85168913 -1.07348477 -0.89337675
  0.96500753  0.17947461  1.87601155 -0.33948984 -0.33263045 -0.8156203
 -0.72262833 -0.19718684]

[(-1.22, -0.56], (0.75, 1.4], (-0.56, 0.093], (0.093, 0.75], (-0.56, 0.093], ..., (-0.56, 0.093], (-0.56, 0.093], (-1.22, -0.56], (-1.22, -0.56], (-0.56, 0.093]]
Length: 20
Categories (5, interval[float64, right]): [(-1.22, -0.56] < (-0.56, 0.093] < (0.093, 0.75] < (0.75, 1.4] < (1.4, 2.05]]

In [42]:
pd.value_counts(cats)

(-1.22, -0.56]    6
(-0.56, 0.093]    5
(0.75, 1.4]       4
(0.093, 0.75]     3
(1.4, 2.05]       2
dtype: int64

In [43]:
data = np.random.randn(1000)
data

array([-6.42796380e-01, -1.56109204e+00, -3.58816846e-01,  2.43235850e+00,
       -3.73371921e-01, -5.06039768e-01,  2.03340011e-01,  2.57354995e-01,
        6.07526533e-01, -4.61597767e-01,  4.10890728e-01,  2.74043110e+00,
        2.60192214e+00,  1.20965746e+00, -1.26827363e+00, -1.13613526e+00,
        5.61819639e-01, -5.76345484e-01, -1.95510420e+00, -2.75314145e-01,
       -1.16455707e+00,  4.39659147e-01,  8.35411795e-02, -9.89747472e-01,
        8.41245833e-02, -6.46185042e-01, -9.80995580e-01,  5.69604885e-01,
       -3.53858009e-01, -1.32752565e-01,  5.83652537e-01,  1.92575106e+00,
       -2.67607466e-01,  2.23749494e-01, -5.47856153e-01,  7.18033313e-02,
       -1.62408520e-01, -7.45659470e-01, -1.33280650e-01, -1.02597270e+00,
       -1.47824604e+00, -1.26428923e-01, -1.71466782e+00,  6.77705364e-01,
       -3.16499606e-01,  7.34294882e-01, -5.58099850e-01, -1.49123899e-03,
       -1.66795023e+00,  1.74906569e+00,  9.45441920e-01, -6.38312058e-02,
       -1.00887555e+00,  4.01759301e-01, -1.22798120e+00,  7.21398290e-01,
       -1.23671072e+00, -3.24104025e-01,  1.05188811e+00, -2.11015043e-01,
       -1.77702675e+00, -5.04610085e-01, -3.58051362e-02, -1.79370285e+00,
        1.35200241e+00,  5.14649055e-01, -8.09365609e-01, -2.01758193e+00,
       -9.21940784e-01,  9.85051658e-01, -4.59979482e-01,  1.31565813e-01,
        8.22888266e-01,  5.57933119e-01,  1.47968980e+00, -7.23116586e-01,
        6.32245638e-01,  2.40680571e-01,  9.63051845e-02,  2.37410768e-01,
        2.41427331e-01, -3.30283573e-01, -1.07152838e+00, -1.65044235e+00,
       -6.26627741e-01, -2.58486030e-02,  1.89586001e+00,  1.35639089e+00,
       -4.23457303e-01, -3.65435531e-01,  4.35190188e-01,  2.94152900e-01,
       -4.66696315e-01, -7.00566838e-01, -1.50486299e+00,  1.18185724e+00,
        7.02211115e-01,  1.56209845e+00,  4.30362032e-01,  1.08221043e+00,
        2.96255562e-01,  9.78459702e-01, -5.51937762e-01,  1.45932271e-01,
        4.87688248e-01, -2.33658511e+00, -9.84859867e-01,  3.60971733e-01,
       -1.21914724e-01, -2.75576731e-01, -1.86289017e-01,  4.40290151e-01,
        1.36991180e+00,  1.36101271e-01, -1.42052459e+00,  1.57675076e+00,
        9.53166539e-01, -7.68193053e-01, -3.34487715e-01,  6.89289342e-01,
       -3.10485021e-01,  8.71767190e-01,  1.33480073e+00, -2.99306681e-01,
       -3.60327203e-01, -1.95471364e+00,  9.79348993e-01,  3.62172434e-01,
        7.67988330e-01, -5.01025178e-01, -2.27994204e-01, -1.07553862e+00,
        4.26815347e-01, -1.19520311e+00, -1.86626921e+00,  9.47719642e-01,
        1.10603980e+00, -1.29939697e+00,  1.90979126e+00,  1.21271207e+00,
       -2.26395044e+00, -3.56488145e-01, -1.49508633e+00,  2.68372568e-01,
       -7.52801751e-01,  2.16781478e-02, -3.72078817e-01,  1.19482320e+00,
       -1.11755624e+00,  1.07766654e+00, -2.00033971e+00, -5.01853292e-01,
       -6.24007199e-01, -4.21201477e-01, -5.30183849e-01, -5.09731667e-01,
       -4.63555476e-01,  3.80677851e-01, -1.89547235e-01,  2.27910057e+00,
       -3.49004573e-01,  4.26820320e-01, -5.04054968e-01,  1.90643176e+00,
       -2.07517953e+00,  8.20029418e-01, -1.01073908e+00, -2.46681661e-01,
       -3.27389435e-01,  1.27844811e+00,  9.85571493e-01, -1.07621223e+00,
        1.49161697e+00,  1.70375108e+00, -5.42052749e-01, -4.55431950e-01,
        1.98803105e+00,  4.38188565e-01, -1.13948631e+00,  8.13026338e-01,
        1.97492166e+00,  5.24606846e-01,  1.43343396e-01, -8.36349824e-01,
        1.34144339e+00, -6.20754519e-01, -3.52328815e-01, -5.51967194e-01,
       -1.31933049e+00, -3.27586596e-01,  1.46297872e+00, -1.42176419e+00,
        1.07613434e+00,  3.33750009e-01,  4.17276259e-01, -4.95964086e-01,
        2.10056631e-01,  8.83244530e-01, -2.55401024e-01,  1.10385811e+00,
       -1.11215849e+00,  4.27871868e-02, -8.29636252e-01, -1.12417489e+00,
        1.92311433e+00,  1.02654483e-01,  6.68916483e-01,  1.25744283e-01,
        1.03062760e+00,  1.61038428e+00, -2.21114417e+00,  6.95577464e-01,
        6.43808396e-01, -7.81502242e-01, -4.32535764e-01,  6.81649749e-01,
        1.09759126e+00,  1.09291809e+00, -7.87120393e-01, -2.91729681e-01,
        1.09309827e+00, -3.62345427e-01,  3.93715269e+00,  1.00616850e+00,
        7.59255224e-01,  4.97837569e-01, -3.42418642e-01,  3.88549195e-01,
       -1.11640330e+00, -1.79458138e+00, -1.47664042e+00,  5.99785257e-01,
        8.18685966e-01,  9.10101892e-02,  9.95258332e-01,  1.56774455e+00,
        8.68905662e-01, -4.39962710e-01, -6.98129778e-01,  2.00536912e+00,
       -9.77483847e-01,  3.82846825e-01,  2.63389035e+00, -3.48811925e-01,
       -1.42565673e-01,  3.97270780e-01, -4.31104443e-01,  5.01256389e-01,
       -1.27873605e-02,  2.76458248e-01,  1.41523983e+00, -2.71239583e-01,
       -4.84863315e-02,  9.08778067e-01,  3.30622984e-01, -1.64202802e+00,
       -1.57518352e-01, -9.06436905e-01, -5.55666319e-01,  1.17851337e+00,
       -1.39220392e+00,  2.92672475e-01, -9.41460475e-01,  4.05873314e-01,
        1.68904857e+00,  2.88627295e-01, -4.60591095e-02, -2.06826570e-02,
        7.67635905e-01,  2.76250410e-01,  1.91973364e+00,  8.42072016e-01,
       -2.56233872e+00,  1.60367799e+00,  1.63901460e+00,  1.08800129e-01,
        5.17276027e-01, -8.59333748e-01, -4.56164009e-01,  1.09729780e+00,
        4.55875360e-02,  8.96047445e-01, -9.82871083e-01,  3.17442572e-01,
        6.36556724e-01, -8.30424171e-01,  2.58440268e-01,  8.66092009e-01,
        9.29051050e-01, -1.81145863e-01, -3.12194084e-02,  4.13281344e-01,
       -3.14739329e-01,  5.40678143e-01, -7.54862396e-01, -1.26786813e+00,
        8.88507274e-01, -7.26224850e-01, -1.47792094e-01,  2.49049659e+00,
       -3.97703936e-01,  1.60322788e+00, -3.60728413e-01,  1.25188028e+00,
       -1.84544816e-01,  1.06566539e-01,  6.15283200e-01, -5.17299503e-01,
       -4.87657938e-01,  1.05505368e+00, -1.79578991e-01, -6.30159239e-01,
       -6.32357753e-01, -3.41946708e-01,  1.05396221e-01,  4.95463714e-01,
        4.72042632e-02, -7.37762418e-01,  1.30614053e+00, -9.23892073e-01,
       -1.98394830e+00, -5.07103724e-01, -9.25819131e-02, -6.72960745e-01,
       -1.96571780e-01,  1.55729193e+00, -6.97849719e-01,  3.22621912e-01,
       -2.13742706e-01,  4.47173593e-01, -6.57109080e-01,  1.27426300e-01,
        1.88097809e+00,  1.38673385e+00,  7.08861854e-01, -2.88929911e+00,
        2.10912027e-01,  5.30866732e-03, -9.07407879e-01,  1.63049596e+00,
        2.49622645e+00,  5.84180119e-01,  3.12309072e-01, -3.23814193e+00,
       -9.31226842e-01, -8.39130091e-01, -1.80673772e+00,  1.47139546e+00,
       -3.71612316e-01,  1.66126501e-01,  1.36984702e-01, -1.14307144e+00,
       -4.41570617e-01,  9.22815261e-01, -6.09857661e-01,  1.62705455e-01,
        1.03816806e+00, -6.33840545e-01,  7.37569020e-01, -6.00618765e-01,
       -4.88124679e-01, -1.57673246e+00, -2.71324202e+00,  5.84523673e-01,
       -1.30076629e-01,  1.28289176e+00, -7.25446410e-01,  1.07164992e+00,
        3.68796233e-01, -2.99991636e-01,  2.02053245e+00, -2.18871724e-01,
        1.06378851e-01, -1.61322141e+00,  2.30453735e-01, -1.26493408e+00,
        5.06907805e-01,  1.96909852e+00, -6.42197978e-01,  8.34193818e-01,
        6.85755578e-03,  1.94143072e+00, -1.57615982e-01,  5.77438126e-01,
        1.15432748e+00, -1.63725429e+00,  1.19050067e+00,  7.35812981e-01,
        2.25214463e-01,  1.59290122e+00,  1.37399777e+00, -5.91986330e-01,
        8.54081828e-02, -4.76117141e-01, -1.43099099e+00, -3.05948974e+00,
        3.75860950e-01, -8.27767042e-01,  1.73072055e-01, -1.43349509e+00,
       -7.29610718e-02, -3.52636972e-01, -1.26165518e+00,  6.34708372e-01,
        5.61508043e-02, -1.04356588e-01, -7.80930903e-02, -1.21932191e+00,
       -1.08525534e+00, -8.39861023e-02,  7.19079703e-01, -5.28589881e-01,
        9.76525882e-01,  4.18497003e-01, -1.31375538e-01,  6.14677165e-01,
       -1.30800111e+00, -1.04582893e-02,  1.54152750e-01, -1.80785099e+00,
        3.74201779e-01,  7.10657322e-01, -9.25846549e-01,  4.32162810e-01,
       -1.60953890e+00,  1.45559737e+00,  1.98193003e+00, -4.12401184e-01,
        4.92773133e-01,  7.07283830e-01, -1.04795095e+00, -3.75774557e-01,
        6.98121626e-01, -1.01479424e+00, -3.20721183e-01, -5.96810738e-01,
       -9.67727662e-01,  1.10484800e+00, -5.81921159e-01, -9.75885630e-01,
        1.46068071e+00, -1.70844681e-02,  3.81263958e-01, -6.32080977e-01,
        9.66234697e-01,  8.44125597e-02, -1.47215264e+00, -1.34531401e+00,
       -9.67725271e-02,  6.41278300e-01, -2.36751329e+00,  8.88582555e-01,
        7.97665970e-01, -1.02083634e+00, -8.05709792e-01, -8.46604126e-02,
       -4.42629395e-01,  2.40649558e+00, -6.63504425e-01,  1.10309893e+00,
        6.54577941e-01,  2.57094655e+00,  2.88972824e-01,  2.10538451e+00,
        3.58952554e-01, -2.12164195e-01, -9.71025101e-01, -8.98076521e-01,
       -5.01304229e-01,  7.54878185e-01,  1.22072005e+00, -1.23892414e-01,
       -1.77664125e-01,  1.96392010e-01,  1.32282391e-01,  6.38006675e-01,
        7.70293740e-01, -4.19127350e-01,  5.68767545e-01,  4.58619373e-01,
        1.00502968e-01, -4.85603177e-02,  8.00865018e-02, -1.76887178e+00,
        1.03870192e+00,  9.31076454e-01,  9.58318608e-01, -6.56150053e-01,
        1.22296689e+00,  8.66593097e-02, -5.57453552e-01, -7.35452309e-01,
       -7.58095251e-01,  6.93845185e-01, -3.00149176e-01,  2.49240721e+00,
        8.98764418e-01, -1.49346443e+00,  9.14992844e-01, -1.12588904e-01,
       -8.02369888e-01,  9.02044970e-01, -9.42346387e-01, -6.08921344e-01,
       -2.19118272e+00,  2.15049476e+00, -2.92289298e-01, -1.31939498e-02,
       -1.42440990e-01,  9.48213901e-01, -4.64802299e-01,  6.05541020e-01,
        1.55580550e+00,  4.49491653e-02, -6.85090436e-01,  4.31166662e-01,
       -2.67321347e-01, -7.25583541e-01, -9.82949487e-02,  2.98942033e-01,
        1.90703943e+00, -1.03581396e+00, -8.02654896e-02,  4.43531693e-02,
        7.66782237e-02,  1.21819900e+00,  1.04818413e+00,  2.29802024e-01,
       -1.74094321e+00,  2.04708800e+00, -2.14302669e+00,  1.71292563e+00,
       -1.68571406e-01,  4.36057656e-01,  7.20156312e-02, -1.60979137e-01,
       -1.94975095e-01,  8.33957991e-01,  1.69840621e+00, -8.94980384e-01,
        1.62366316e-02, -7.35232320e-01, -8.44305560e-01,  8.05001465e-01,
       -1.40217201e+00, -4.41637816e-01, -6.37560956e-01,  1.12820929e+00,
       -1.61325431e-01,  1.59842937e+00, -9.66389342e-01,  6.80432079e-01,
        8.56003018e-01, -2.51358077e-01, -1.51467250e+00,  7.16753321e-01,
        1.68983884e+00, -2.44847695e+00, -1.47619029e+00,  1.26082554e+00,
        4.93877382e-02,  4.33137131e-01, -4.61181648e-01,  1.34037399e+00,
       -7.99626826e-03, -8.24310492e-01,  5.97730853e-01,  8.01629397e-01,
        7.32859504e-02, -7.47729972e-01,  4.30757327e-01,  8.34794387e-01,
        4.77226084e-01, -1.35158666e+00, -3.63166503e-01, -4.16101026e-01,
        1.36074269e+00,  3.25879394e+00, -1.91336332e+00,  4.07903653e-02,
       -9.32559366e-02,  8.65396349e-01, -1.48292785e-02, -5.82761911e-03,
        2.66902102e-01, -9.84487629e-01, -6.44826181e-01, -3.54448762e-01,
        3.18146511e-01, -4.52876635e-01, -2.06570783e+00,  1.77526780e+00,
        6.64972164e-01, -6.56849276e-01,  2.24316208e+00, -1.58062493e-01,
        1.74413388e+00, -2.45229667e-01, -5.21705481e-01,  2.70313891e-01,
       -2.60125621e-01,  7.71168951e-02, -8.70943847e-01,  2.16877379e-01,
        7.01678279e-01,  1.45529494e+00, -1.48013367e-01,  1.06779211e+00,
       -5.41607351e-01,  3.33598212e+00,  1.98228956e+00,  3.31199098e-01,
        1.08845435e+00,  1.16074448e+00, -9.34765845e-01, -1.16483085e+00,
       -3.86651511e-01,  1.22017641e-02, -6.36910584e-02,  2.21958536e+00,
       -2.89488334e-01, -9.97219651e-02, -1.30601753e-01,  1.94588552e-01,
       -2.79441771e-02,  7.34214861e-01, -2.21405829e-02, -1.49527184e+00,
        2.65545884e-01,  1.88816336e-01,  1.71814802e+00, -9.22238311e-01,
        1.82263219e-01,  4.53031653e-01,  1.57824480e+00,  1.27395802e+00,
        9.50676460e-02,  2.09717902e-01,  1.70110635e+00,  5.44307837e-01,
        7.76451561e-02,  1.70959816e+00, -1.89945264e+00,  8.78579058e-01,
       -1.09469879e+00, -4.98928018e-01,  1.89455745e+00, -3.06203835e-01,
        5.42859558e-01,  5.84877703e-01,  2.08434335e-01,  1.11613942e+00,
        1.15171967e+00,  1.88447967e+00, -1.26485221e+00, -7.87424833e-01,
        1.53418114e+00,  3.59544809e-01, -1.07580527e+00,  1.06417665e+00,
        9.18498310e-01,  9.92432092e-01,  1.96009393e+00,  1.78737481e-01,
       -8.67439856e-01,  1.51408004e+00, -7.01511232e-01,  3.29356851e-01,
       -1.16009507e+00,  1.22424441e+00,  8.21730222e-01, -1.56750307e-01,
       -1.13252529e+00,  1.75657746e+00, -1.07122654e+00,  6.62878299e-01,
       -1.64190929e+00,  1.42359148e+00,  1.19527037e+00, -5.52137217e-01,
        2.06819266e+00,  3.53843647e-01,  4.30685901e-01, -2.95576208e-01,
       -2.44655099e-01, -6.10831413e-01,  3.91488800e-01, -2.12244053e-01,
        2.06761983e-01, -5.62300655e-01,  2.13573280e+00, -3.39921147e-01,
        3.95291890e-01,  6.45639880e-01,  9.26214620e-01, -1.05781821e+00,
        1.05393644e+00,  5.16760624e-01,  7.05221098e-01,  7.06988611e-02,
       -7.57135865e-01, -1.60951602e-01,  5.94404647e-01, -1.40219597e-02,
       -1.33113759e+00, -1.90422783e+00,  1.40117487e+00, -1.24420684e-02,
       -2.72739330e-01,  2.83783617e-01,  1.87012634e-01, -8.13925222e-01,
       -1.40119082e+00,  2.46922130e-01, -7.75680535e-01,  5.49460183e-01,
       -3.10170770e-01,  1.07623658e+00, -2.07532592e-03,  3.71027660e-02,
       -6.28252794e-01, -1.12233660e+00,  2.15937859e+00,  8.03328011e-01,
        3.55917893e-01, -4.76735059e-01,  4.86804220e-02, -4.79167370e-01,
        9.86756788e-01, -4.17311416e-02,  3.05908486e-02, -9.92356210e-01,
       -3.06522479e-01, -2.46617585e+00, -6.54804915e-01, -8.92273327e-01,
       -7.86235915e-01,  6.00189739e-01, -2.71947502e-01,  6.62984035e-02,
       -1.23686161e+00, -1.21926514e+00, -1.34040303e+00,  1.27561982e+00,
       -7.02953365e-01, -8.94375008e-01,  6.25911845e-01, -1.44363040e-01,
        7.70155226e-01, -2.50927535e-01,  2.78695712e-01,  3.27726877e-01,
        1.31338979e+00, -4.28638056e-01, -3.86819200e-01,  1.61128860e+00,
       -2.40635397e+00,  6.25365374e-02, -1.18043668e+00, -5.58528399e-01,
        3.08868305e-01,  1.48017988e-01,  3.55603830e-01,  2.45103949e-01,
       -1.99497144e+00, -2.85152588e-01,  3.74849326e-01,  9.36415577e-01,
       -1.13375416e+00,  1.53640519e-01, -5.43340180e-02,  9.63461535e-02,
        9.00321623e-01,  1.66522967e-01, -1.61909527e+00,  1.86025140e-01,
       -6.82726539e-02,  1.64196253e-01,  2.37698492e+00,  5.01657522e-01,
       -5.28043199e-01, -6.96344415e-01,  5.73059943e-01, -7.26174720e-01,
        5.05313966e-01,  5.37397694e-01, -1.33228659e+00, -1.48726119e+00,
       -5.85874251e-01, -1.16194414e+00, -1.80701540e-01, -2.21400485e-01,
       -5.04237357e-01, -7.21071649e-01,  5.60994064e-01, -2.01374121e-01,
        1.30432251e+00,  1.08390820e+00, -4.93503027e-01, -7.63248612e-01,
       -1.34423141e-01, -1.24174776e+00, -8.12478780e-01,  2.20409676e-01,
        6.62303980e-01,  3.60842093e-01, -2.95933167e-01,  3.31405557e-01,
       -1.28045370e+00, -4.91511154e-01, -1.41937177e+00, -3.01006852e-02,
       -4.85187604e-01, -5.32102939e-01,  7.40400511e-01,  6.47959077e-01,
       -2.04160053e-01, -3.05406356e-01,  6.24924294e-01,  3.02292064e-01,
       -1.83635827e+00,  7.53336036e-01, -8.91902716e-01,  1.06572649e+00,
       -1.00158263e-01,  4.40615974e-01,  4.91948848e-01, -4.93680609e-02,
       -4.67622737e-01,  1.57668262e+00,  2.58483685e-02,  6.18623683e-01,
       -3.75513039e-01,  2.22214075e+00,  3.48531189e-01,  1.36703415e-01,
       -8.22871420e-01,  9.03991927e-01,  4.27495498e-01,  2.08225683e+00,
       -7.61346461e-01,  1.67890959e-01,  1.96206009e+00,  7.10743320e-01,
       -1.27433807e-01,  1.25078781e+00, -6.55734609e-01, -3.23515377e-01,
        8.47242958e-01, -1.55217157e-01,  3.12011166e-01,  1.16024333e+00,
        1.26938975e+00, -6.86803980e-01,  1.42695073e+00, -1.99709045e+00,
       -8.03970191e-02, -7.08889611e-01,  9.93674366e-01,  1.43174267e-01,
       -1.56440801e-01,  1.82272819e-01,  8.37082891e-01, -4.62071754e-01,
       -1.87821520e+00, -1.53364186e+00,  8.38741367e-01,  9.21546026e-01,
        1.76584037e+00,  5.92737639e-01,  5.57523853e-01,  8.38223400e-01,
       -5.70098242e-01, -8.46505568e-02, -6.72267649e-01, -2.01000084e-01,
       -1.66601146e-01, -9.22892692e-01,  1.50775827e+00, -8.10731512e-02,
       -3.70307692e-01, -3.91054204e-01, -8.95973947e-01, -4.98093799e-01,
        9.23514303e-01, -1.56111852e+00, -5.81035818e-01,  4.22957535e-02,
       -4.82348674e-01,  5.88506049e-02, -1.13187045e+00,  7.66961347e-01,
       -3.52300000e-02, -1.26388777e+00, -1.09551664e+00, -3.11442731e-01,
        4.80348065e-01, -1.50263172e+00, -7.14871094e-01, -1.25915986e+00,
       -1.11558180e+00,  3.98144501e-01,  5.61297200e-01, -6.96632990e-01,
       -9.21629943e-02,  3.49100392e-01, -1.36894724e+00,  1.61352014e+00,
        1.84839666e+00, -3.52397359e-01,  3.08716356e-01,  8.51150116e-01,
        1.52418192e+00, -4.37686607e-01,  4.28547764e-01,  1.12459251e+00,
        7.37393333e-01, -1.62527756e-01, -1.18128789e+00,  3.54761085e-01,
       -1.08165002e+00,  5.40464509e-01, -3.04673973e-01, -3.07261910e-01,
        1.48066404e+00,  1.14968183e-01,  5.19002709e-01,  8.64862292e-01,
        7.31424877e-01, -1.47584754e+00, -1.35614146e-01, -9.93680467e-01,
        4.73558644e-01, -1.50087295e-01, -4.75346271e-01, -6.21407646e-01,
        3.22546677e-01,  7.99512136e-01, -5.05081651e-01, -5.22136395e-01,
       -3.33003708e-01,  1.15694005e-01, -2.01130663e+00, -1.49452018e+00,
        2.10474897e-01,  1.31464437e+00,  5.92763823e-01,  2.35471143e+00,
        3.43291215e-01,  6.16364371e-01,  5.81571331e-01, -6.45685951e-01,
        1.64195201e+00, -1.18238330e+00, -2.08099848e-01,  1.06922051e+00,
        3.97812953e-01,  1.13147601e+00, -2.13697891e+00, -6.70683795e-01,
        5.20413348e-01,  3.77319750e-01,  1.27323308e+00,  4.21567310e-01,
       -4.82888099e-01, -3.96679777e-01,  2.02898822e+00,  4.28099429e-03,
        1.69513321e-01,  8.38083480e-01, -2.32786402e+00, -5.23500513e-01,
       -3.92235374e-01, -1.20202643e-01,  1.25036736e-01,  4.97100074e-01,
       -1.16337278e-02,  1.16628376e+00, -7.86275074e-01, -8.42206910e-01,
       -7.75280850e-01,  4.68127421e-01,  7.20296223e-01, -4.32684207e-01,
        1.30966195e+00,  3.83543487e-01,  8.40054477e-02, -8.78819660e-01,
        2.23528791e+00, -1.26675282e+00,  4.73333129e-01,  5.57853844e-01,
       -4.40054994e-01, -1.34407560e+00, -1.02867530e+00, -9.06338229e-01,
       -1.49032527e+00, -1.44267381e+00, -3.49160531e-01,  6.53292867e-01])

In [45]:
# qcut will bin the data based on sample quantiles
# usually cut does to result in each bin having the same number of data points
# but qcut results in roughly equal-sized bins
cats = pd.qcut(data, 4)
cats

[(-3.239, -0.598], (-3.239, -0.598], (-0.598, 0.0238], (0.699, 3.937], (-0.598, 0.0238], ..., (-3.239, -0.598], (-3.239, -0.598], (-3.239, -0.598], (-0.598, 0.0238], (0.0238, 0.699]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.239, -0.598] < (-0.598, 0.0238] < (0.0238, 0.699] < (0.699, 3.937]]

In [46]:
pd.value_counts(cats)

(-3.239, -0.598]    250
(-0.598, 0.0238]    250
(0.0238, 0.699]     250
(0.699, 3.937]      250
dtype: int64

In [48]:
# we can also pass our own quantiles
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])
cats

[(-1.198, 0.0238], (-3.239, -1.198], (-1.198, 0.0238], (1.342, 3.937], (-1.198, 0.0238], ..., (-1.198, 0.0238], (-3.239, -1.198], (-3.239, -1.198], (-1.198, 0.0238], (0.0238, 1.342]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.239, -1.198] < (-1.198, 0.0238] < (0.0238, 1.342] < (1.342, 3.937]]

In [49]:
pd.value_counts(cats)

(-1.198, 0.0238]    400
(0.0238, 1.342]     400
(-3.239, -1.198]    100
(1.342, 3.937]      100
dtype: int64

### Detecting and Filtering outliers

In [52]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.602741 -1.914017  1.001027  0.122792
1    0.287530  0.630660  0.462395 -0.705865
2    0.838517 -0.950752  0.008756  0.151138
3   -0.471772  1.269986 -0.266072 -0.851315
4    1.246659  0.974355  1.528800 -0.221800
..        ...       ...       ...       ...
995 -0.243219 -0.135802 -0.285111  0.530592
996 -1.736700 -1.838425  0.349591 -1.427196
997  0.101353 -1.102801 -0.884345 -0.089015
998 -0.533154  0.724358 -0.227200  0.006287
999 -2.098587  1.396923  0.489805 -0.261741

[1000 rows x 4 columns]

In [51]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.032390    -0.020908     0.000712    -0.012014
std       0.972431     0.964613     0.995895     0.983268
min      -3.353052    -2.758945    -3.737638    -3.216224
25%      -0.576370    -0.667037    -0.668830    -0.676661
50%       0.006649    -0.027533     0.017716    -0.044206
75%       0.663112     0.611605     0.703865     0.688035
max       3.187110     2.765438     3.242484     3.806143

In [53]:
# suppose we want to find values in one columns that exceeds 3 in absolute value
col = data[2]
col[np.abs(col) > 3]

142   -3.100257
143    3.486410
465   -3.592826
Name: 2, dtype: float64

In [54]:
# to select all rows having a value exceeding 3 or -3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
142  1.219873 -0.700736 -3.100257 -0.490328
143  1.705364 -1.578445  3.486410 -1.997214
213  3.011729  0.041818  0.651960  1.215590
465 -1.237052  0.141069 -3.592826  1.953991
585  3.469427 -0.849585 -0.715590  0.624377
708  0.439652  3.020274  0.595352 -1.522286
958 -3.109219 -0.152766  0.221647  1.539188

In [56]:
# code to cap values b/w 3 and -3
data[np.abs(data) > 3] = np.sign(data) * 3 # np.sign produces 1 and -1 values based on if the valie is positive or nrgative
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021665    -0.064484    -0.026089    -0.019826
std       0.974416     1.003024     0.982220     1.015720
min      -3.000000    -2.948193    -3.000000    -2.762057
25%      -0.686123    -0.742015    -0.708716    -0.741289
50%      -0.008324    -0.060077    -0.050735    -0.010661
75%       0.688259     0.610844     0.665717     0.669418
max       3.000000     3.000000     3.000000     2.870856

In [58]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0  1.0  1.0 -1.0

### Permutation and Random Sampling
A permutation is basically a specific arrangement

In [59]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))
# we use permutaion to genearte a permutation by passing the lenth of value to be permutated
sampler = np.random.permutation(5) 
sampler

array([4, 1, 3, 2, 0])

In [60]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [61]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [63]:
# sample - to select a random subset without any repetions 
df.sample(n=3) # n is th enumber of rows

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [64]:
# to allow for repetitions we pass replace=True in sample()
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
2   -1
1    7
2   -1
3    6
2   -1
1    7
4    4
4    4
dtype: int64

### Computing Indicator/Dummy Variables
A major thing in ML is to converting categorical data into a 'dummy' or 'indicator' matrix
If a column as k distinct values
We would derive a matrix/dataframe with k columns contianing only 0's and 1's

In [66]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 .....: 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
# we use get_dummies to generate a dummy/indicator matrix
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [69]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [70]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [74]:
# a useful application of statistical applications is to combine get_dummies with cut
np.random.seed(12345)

In [75]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [76]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation
pandas allows for string operartions and regular expressions on whole arrays of data

In [1]:
import pandas as pd
import numpy as np

### String object methods

In [2]:
# split() - splitting a string using a delimeter
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [3]:
# strip() - used to trim whitespace and line breaks
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [5]:
# concatenate strings using + operator 
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [6]:
# join() - concatenates strings and we can pass a delimiter to come between each induvidual string
'::'.join(pieces)

'a::b::guido'

In [7]:
# in - this method is used to detect substrings within a string
'guido' in val

True

In [11]:
# index(), find() - to locate substrings within a string
val.index(',')

1

In [10]:
val.find(':') # find() returns -1 if not found

-1

In [12]:
val.index(":") # index() will raise an exception if not found

ValueError: substring not found

In [14]:
# count() - returns the number of occurances of the passed srgument
val.count(",")

2

In [16]:
# replace() - we can substitute one value for another
val.replace(',', ';')

'a;b;  guido'

In [17]:
val.replace(',', '')

'ab  guido'

### Regular expressions
Used to search or match string patterns in text

In [20]:
# splitting a string with a variable amount of whitespaces
import re
text = "foo   bar\tbaz       \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

While executing regex in Python, the regular expression is first compiled and then the function you have used it in, is then executed.

In [21]:
# compile() - we can complie regex ourselves (improves execution time)
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [22]:
# findall() - we can find all the patterns matching our regex
regex.findall(text)

['   ', '\t', '       \t']

To avoid encountering unwanted escape sequences we use raw strings, r"string data...." insted of regular strings

In [24]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [25]:
# search() - similar to findall but reuturns only the first match
m = regex.search(text)
m # returns a special match object

In [26]:
text[m.start():m.end()]

'dave@google.com'

In [29]:
# match() - will only check if the pattern occurs in the beginning of the string 
print(regex.match(text))

None

In [30]:
# sub() - we can replace/sunstitue the occurances with something else
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [31]:
# dividing the email into 3 segments
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [32]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [33]:
# we can also access the groups in sub using symbols like \1, \2, .... each number corresponding to the occurences of the group
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized string functions in Pandas

In [34]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
 .....: 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [35]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

String or regex operations will fail on null values. To cope up with this, we can use a Series str attribute to check for certain patterns

In [37]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [38]:
# we can use regex too
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [39]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [43]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object